Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: وقال الذين استضعفوا للذين استكبروا بل مكر الليل والنهار إذ تأمروننا أن نكفر بالله ونجعل له أندادا وأسروا الندامة لما رأوا العذاب وجعلنا الأغلال في أعناق الذين كفروا هل يجزون إلا ما كانوا يعملون
en: Those who were oppressed will say to those who were arrogant, "Rather, [it was your] conspiracy of night and day when you were ordering us to disbelieve in Allah and attribute to Him equals." But they will [all] confide regret when they see the punishment; and We will put shackles on the necks of those who disbelieved. Will they be recompensed except for what they used to do?

source: وما أرسلنا في قرية من نذير إلا قال مترفوها إنا بما أرسلتم به كافرون
en: And We did not send into a city any warner except that its affluent said, "Indeed we, in that with which you were sent, are disbelievers."

source: وقالوا نحن أكثر أموالا وأولادا وما نحن بمعذبين
en: And they said, "We are more [than the believers] in wealth and children, and we are not to be punished."

source: قل إن ربي يبسط الرزق لمن يشاء ويقدر ولكن أكثر الناس لا يعلمون
en: Say, "Indeed, my Lord extends provision for whom He wills and restricts [it], but most of the people do not know."

source: وما أموالكم ولا أولادكم بالتي تقربكم عندنا زلفى إلا من آمن وعمل صالحا فأولئك لهم جزاء الضعف بما عملوا وهم في الغرفات آمنون
en: And it is not your wealth or your children that bring you nearer to Us in position, but it is [by being] one who has believed and done righteousness. For them there will be the double reward for what they did, and they will be in the upper chambers [of Paradise], safe [and secure].

source: والذين يسعون في آياتنا معاجزين أولئك في العذاب محضرون
en: And the ones who strive against Our verses to cause [them] failure - those will be brought into the punishment [to remain].

source: قل إن ربي يبسط الرزق لمن يشاء من عباده ويقدر له وما أنفقتم من شيء فهو يخلفه وهو خير الرازقين
en: Say, "Indeed, my Lord extends provision for whom He wills of His servants and restricts [it] for him. But whatever thing you spend [in His cause] - He will compensate it; and He is the best of providers."

source: ويوم يحشرهم جميعا ثم يقول للملائكة أهؤلاء إياكم كانوا يعبدون
en: And [mention] the Day when He will gather them all and then say to the angels, "Did these [people] used to worship you?"

source: قالوا سبحانك أنت ولينا من دونهم بل كانوا يعبدون الجن أكثرهم بهم مؤمنون
en: They will say, "Exalted are You! You, [O Allah], are our benefactor not them. Rather, they used to worship the jinn; most of them were believers in them."

source: فاليوم لا يملك بعضكم لبعض نفعا ولا ضرا ونقول للذين ظلموا ذوقوا عذاب النار التي كنتم بها تكذبون
en: But today you do not hold for one another [the power of] benefit or harm, and We will say to those who wronged, "Taste the punishment of the Fire, which you used to deny."

source: وإذا تتلى عليهم آياتنا بينات قالوا ما هذا إلا رجل يريد أن يصدكم عما كان يعبد آباؤكم وقالوا ما هذا إلا إفك مفترى وقال الذين كفروا للحق لما جاءهم إن هذا إلا سحر مبين
en: And when our verses are recited to them as clear evidences, they say, "This is not but a man who wishes to avert you from that which your fathers were worshipping." And they say, "This is not except a lie invented." And those who disbelieve say of the truth when it has come to them, "This is not but obvious magic."

source: وما آتيناهم من كتب يدرسونها وما أرسلنا إليهم قبلك من نذير
en: And We had not given them any scriptures which they could study, and We had not sent to them before you, [O Muhammad], any warner.

source: وكذب الذين من قبلهم وما بلغوا معشار ما آتيناهم فكذبوا رسلي فكيف كان نكير
en: And those before them denied, and the people of Makkah have not attained a tenth of what We had given them. But the former peoples denied My messengers, so how [terrible] was My reproach.

source: قل إنما أعظكم بواحدة أن تقوموا لله مثنى وفرادى ثم تتفكروا ما بصاحبكم من جنة إن هو إلا نذير لكم بين يدي عذاب شديد
en: Say, "I only advise you of one [thing] - that you stand for Allah, [seeking truth] in pairs and individually, and then give thought." There is not in your companion any madness. He is only a warner to you before a severe punishment.

source: قل ما سألتكم من أجر فهو لكم إن أجري إلا على الله وهو على كل شيء شهيد
en: Say, "Whatever payment I might have asked of you - it is yours. My payment is only from Allah, and He is, over all things, Witness."

source: قل إن ربي يقذف بالحق علام الغيوب
en: Say, "Indeed, my Lord projects the truth. Knower of the unseen."

source: قل جاء الحق وما يبدئ الباطل وما يعيد
en: Say, "The truth has come, and falsehood can neither begin [anything] nor repeat [it]."

source: قل إن ضللت فإنما أضل على نفسي وإن اهتديت فبما يوحي إلي ربي إنه سميع قريب
en: Say, "If I should err, I would only err against myself. But if I am guided, it is by what my Lord reveals to me. Indeed, He is Hearing and near."

source: ولو ترى إذ فزعوا فلا فوت وأخذوا من مكان قريب
en: And if you could see when they are terrified but there is no escape, and they will be seized from a place nearby.

source: وقالوا آمنا به وأنى لهم التناوش من مكان بعيد
en: And they will [then] say, "We believe in it!" But how for them will be the taking [of faith] from a place far away?

source: وقد كفروا به من قبل ويقذفون بالغيب من مكان بعيد
en: And they had already disbelieved in it before and would assault the unseen from a place far away.

source: وحيل بينهم وبين ما يشتهون كما فعل بأشياعهم من قبل إنهم كانوا في شك مريب
en: And prevention will be placed between them and what they desire, as was done with their kind before. Indeed, they were in disquieting denial.

source: الحمد لله فاطر السماوات والأرض جاعل الملائكة رسلا أولي أجنحة مثنى وثلاث ورباع يزيد في الخلق ما يشاء إن الله على كل شيء قدير
en: [All] praise is [due] to Allah, Creator of the heavens and the earth, [who] made the angels messengers having wings, two or three or four. He increases in creation what He wills. Indeed, Allah is over all things competent.

source: ما يفتح الله للناس من رحمة فلا ممسك لها وما يمسك فلا مرسل له من بعده وهو العزيز الحكيم
en: Whatever Allah grants to people of mercy - none can withhold it; and whatever He withholds - none can release it thereafter. And He is the Exalted in Might, the Wise.

source: يا أيها الناس اذكروا نعمت الله عليكم هل من خالق غير الله يرزقكم من السماء والأرض لا إله إلا هو فأنى تؤفكون
en: O mankind, remember the favor of Allah upon you. Is there any creator other than Allah who provides for you from the heaven and earth? There is no deity except Him, so how are you deluded?

source: وإن يكذبوك فقد كذبت رسل من قبلك وإلى الله ترجع الأمور
en: And if they deny you, [O Muhammad] - already were messengers denied before you. And to Allah are returned [all] matters.

source: يا أيها الناس إن وعد الله حق فلا تغرنكم الحياة الدنيا ولا يغرنكم بالله الغرور
en: O mankind, indeed the promise of Allah is truth, so let not the worldly life delude you and be not deceived about Allah by the Deceiver.

source: إن الشيطان لكم عدو فاتخذوه عدوا إنما يدعو حزبه ليكونوا من أصحاب السعير
en: Indeed, Satan is an enemy to you; so take him as an enemy. He only invites his party to be among the companions of the Blaze.

source: الذين كفروا لهم عذاب شديد والذين آمنوا وعملوا الصالحات لهم مغفرة وأجر كبير
en: Those who disbelieve will have a severe punishment, and those who believe and do righteous deeds will have forgiveness and great reward.

source: أفمن زين له سوء عمله فرآه حسنا فإن الله يضل من يشاء ويهدي من يشاء فلا تذهب نفسك عليهم حسرات إن الله عليم بما يصنعون
en: Then is one to whom the evil of his deed has been made attractive so he considers it good [like one rightly guided]? For indeed, Allah sends astray whom He wills and guides whom He wills. So do not let yourself perish over them in regret. Indeed, Allah is Knowing of what they do.

source: والله الذي أرسل الرياح فتثير سحابا فسقناه إلى بلد ميت فأحيينا به الأرض بعد موتها كذلك النشور
en: And it is Allah who sends the winds, and they stir the clouds, and We drive them to a dead land and give life thereby to the earth after its lifelessness. Thus is the resurrection.

source: من كان يريد العزة فلله العزة جميعا إليه يصعد الكلم الطيب والعمل الصالح يرفعه والذين يمكرون السيئات لهم عذاب شديد ومكر أولئك هو يبور
en: Whoever desires honor [through power] - then to Allah belongs all honor. To Him ascends good speech, and righteous work raises it. But they who plot evil deeds will have a severe punishment, and the plotting of those - it will perish.

source: والله خلقكم من تراب ثم من نطفة ثم جعلكم أزواجا وما تحمل من أنثى ولا تضع إلا بعلمه وما يعمر من معمر ولا ينقص من عمره إلا في كتاب إن ذلك على الله يسير
en: And Allah created you from dust, then from a sperm-drop; then He made you mates. And no female conceives nor does she give birth except with His knowledge. And no aged person is granted [additional] life nor is his lifespan lessened but that it is in a register. Indeed, that for Allah is easy.

source: وما يستوي البحران هذا عذب فرات سائغ شرابه وهذا ملح أجاج ومن كل تأكلون لحما طريا وتستخرجون حلية تلبسونها وترى الفلك فيه مواخر لتبتغوا من فضله ولعلكم تشكرون
en: And not alike are the two bodies of water. One is fresh and sweet, palatable for drinking, and one is salty and bitter. And from each you eat tender meat and extract ornaments which you wear, and you see the ships plowing through [them] that you might seek of His bounty; and perhaps you will be grateful.

source: يولج الليل في النهار ويولج النهار في الليل وسخر الشمس والقمر كل يجري لأجل مسمى ذلكم الله ربكم له الملك والذين تدعون من دونه ما يملكون من قطمير
en: He causes the night to enter the day, and He causes the day to enter the night and has subjected the sun and the moon - each running [its course] for a specified term. That is Allah, your Lord; to Him belongs sovereignty. And those whom you invoke other than Him do not possess [as much as] the membrane of a date seed.

source: إن تدعوهم لا يسمعوا دعاءكم ولو سمعوا ما استجابوا لكم ويوم القيامة يكفرون بشرككم ولا ينبئك مثل خبير
en: If you invoke them, they do not hear your supplication; and if they heard, they would not respond to you. And on the Day of Resurrection they will deny your association. And none can inform you like [one] Acquainted [with all matters].

source: يا أيها الناس أنتم الفقراء إلى الله والله هو الغني الحميد
en: O mankind, you are those in need of Allah, while Allah is the Free of need, the Praiseworthy.

source: إن يشأ يذهبكم ويأت بخلق جديد
en: If He wills, He can do away with you and bring forth a new creation.

source: ولا تزر وازرة وزر أخرى وإن تدع مثقلة إلى حملها لا يحمل منه شيء ولو كان ذا قربى إنما تنذر الذين يخشون ربهم بالغيب وأقاموا الصلاة ومن تزكى فإنما يتزكى لنفسه وإلى الله المصير
en: And no bearer of burdens will bear the burden of another. And if a heavily laden soul calls [another] to [carry some of] its load, nothing of it will be carried, even if he should be a close relative. You can only warn those who fear their Lord unseen and have established prayer. And whoever purifies himself only purifies himself for [the benefit of] his soul. And to Allah is the [final] destination.

source: وما يستوي الأعمى والبصير
en: Not equal are the blind and the seeing,

source: ولا الظلمات ولا النور
en: Nor are the darknesses and the light,

source: ولا الظل ولا الحرور
en: Nor are the shade and the heat,

source: وما يستوي الأحياء ولا الأموات إن الله يسمع من يشاء وما أنت بمسمع من في القبور
en: And not equal are the living and the dead. Indeed, Allah causes to hear whom He wills, but you cannot make hear those in the graves.

source: إن أنت إلا نذير
en: You, [O Muhammad], are not but a warner.

source: إنا أرسلناك بالحق بشيرا ونذيرا وإن من أمة إلا خلا فيها نذير
en: Indeed, We have sent you with the truth as a bringer of good tidings and a warner. And there was no nation but that there had passed within it a warner.

source: وإن يكذبوك فقد كذب الذين من قبلهم جاءتهم رسلهم بالبينات وبالزبر وبالكتاب المنير
en: And if they deny you - then already have those before them denied. Their messengers came to them with clear proofs and written ordinances and with the enlightening Scripture.

source: ثم أخذت الذين كفروا فكيف كان نكير
en: Then I seized the ones who disbelieved, and how [terrible] was My reproach.

source: ألم تر أن الله أنزل من السماء ماء فأخرجنا به ثمرات مختلفا ألوانها ومن الجبال جدد بيض وحمر مختلف ألوانها وغرابيب سود
en: Do you not see that Allah sends down rain from the sky, and We produce thereby fruits of varying colors? And in the mountains are tracts, white and red of varying shades and [some] extremely black.

source: ومن الناس والدواب والأنعام مختلف ألوانه كذلك إنما يخشى الله من عباده العلماء إن الله عزيز غفور
en: And among people and moving creatures and grazing livestock are various colors similarly. Only those fear Allah, from among His servants, who have knowledge. Indeed, Allah is Exalted in Might and Forgiving.

source: إن الذين يتلون كتاب الله وأقاموا الصلاة وأنفقوا مما رزقناهم سرا وعلانية يرجون تجارة لن تبور
en: Indeed, those who recite the Book of Allah and establish prayer and spend [in His cause] out of what We have provided them, secretly and publicly, [can] expect a profit that will never perish -

source: ليوفيهم أجورهم ويزيدهم من فضله إنه غفور شكور
en: That He may give them in full their rewards and increase for them of His bounty. Indeed, He is Forgiving and Appreciative.

source: والذي أوحينا إليك من الكتاب هو الحق مصدقا لما بين يديه إن الله بعباده لخبير بصير
en: And that which We have revealed to you, [O Muhammad], of the Book is the truth, confirming what was before it. Indeed, Allah, of His servants, is Acquainted and Seeing.

source: ثم أورثنا الكتاب الذين اصطفينا من عبادنا فمنهم ظالم لنفسه ومنهم مقتصد ومنهم سابق بالخيرات بإذن الله ذلك هو الفضل الكبير
en: Then we caused to inherit the Book those We have chosen of Our servants; and among them is he who wrongs himself, and among them is he who is moderate, and among them is he who is foremost in good deeds by permission of Allah. That [inheritance] is what is the great bounty.

source: جنات عدن يدخلونها يحلون فيها من أساور من ذهب ولؤلؤا ولباسهم فيها حرير
en: [For them are] gardens of perpetual residence which they will enter. They will be adorned therein with bracelets of gold and pearls, and their garments therein will be silk.

source: وقالوا الحمد لله الذي أذهب عنا الحزن إن ربنا لغفور شكور
en: And they will say, "Praise to Allah, who has removed from us [all] sorrow. Indeed, our Lord is Forgiving and Appreciative -

source: الذي أحلنا دار المقامة من فضله لا يمسنا فيها نصب ولا يمسنا فيها لغوب
en: He who has settled us in the home of duration out of His bounty. There touches us not in it any fatigue, and there touches us not in it weariness [of mind]."

source: والذين كفروا لهم نار جهنم لا يقضى عليهم فيموتوا ولا يخفف عنهم من عذابها كذلك نجزي كل كفور
en: And for those who disbelieve will be the fire of Hell. [Death] is not decreed for them so they may die, nor will its torment be lightened for them. Thus do we recompense every ungrateful one.

source: وهم يصطرخون فيها ربنا أخرجنا نعمل صالحا غير الذي كنا نعمل أولم نعمركم ما يتذكر فيه من تذكر وجاءكم النذير فذوقوا فما للظالمين من نصير
en: And they will cry out therein, "Our Lord, remove us; we will do righteousness - other than what we were doing!" But did We not grant you life enough for whoever would remember therein to remember, and the warner had come to you? So taste [the punishment], for there is not for the wrongdoers any helper.

source: إن الله عالم غيب السماوات والأرض إنه عليم بذات الصدور
en: Indeed, Allah is Knower of the unseen [aspects] of the heavens and earth. Indeed, He is Knowing of that within the breasts.

source: هو الذي جعلكم خلائف في الأرض فمن كفر فعليه كفره ولا يزيد الكافرين كفرهم عند ربهم إلا مقتا ولا يزيد الكافرين كفرهم إلا خسارا
en: It is He who has made you successors upon the earth. And whoever disbelieves - upon him will be [the consequence of] his disbelief. And the disbelief of the disbelievers does not increase them in the sight of their Lord except in hatred; and the disbelief of the disbelievers does not increase them except in loss.

source: قل أرأيتم شركاءكم الذين تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات أم آتيناهم كتابا فهم على بينت منه بل إن يعد الظالمون بعضهم بعضا إلا غرورا
en: Say, "Have you considered your 'partners' whom you invoke besides Allah? Show me what they have created from the earth, or have they partnership [with Him] in the heavens? Or have We given them a book so they are [standing] on evidence therefrom? [No], rather, the wrongdoers do not promise each other except delusion."

source: إن الله يمسك السماوات والأرض أن تزولا ولئن زالتا إن أمسكهما من أحد من بعده إنه كان حليما غفورا
en: Indeed, Allah holds the heavens and the earth, lest they cease. And if they should cease, no one could hold them [in place] after Him. Indeed, He is Forbearing and Forgiving.

source: وأقسموا بالله جهد أيمانهم لئن جاءهم نذير ليكونن أهدى من إحدى الأمم فلما جاءهم نذير ما زادهم إلا نفورا
en: And they swore by Allah their strongest oaths that if a warner came to them, they would be more guided than [any] one of the [previous] nations. But when a warner came to them, it did not increase them except in aversion.

source: استكبارا في الأرض ومكر السيئ ولا يحيق المكر السيئ إلا بأهله فهل ينظرون إلا سنت الأولين فلن تجد لسنت الله تبديلا ولن تجد لسنت الله تحويلا
en: [Due to] arrogance in the land and plotting of evil; but the evil plot does not encompass except its own people. Then do they await except the way of the former peoples? But you will never find in the way of Allah any change, and you will never find in the way of Allah any alteration.

source: أولم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم وكانوا أشد منهم قوة وما كان الله ليعجزه من شيء في السماوات ولا في الأرض إنه كان عليما قديرا
en: Have they not traveled through the land and observed how was the end of those before them? And they were greater than them in power. But Allah is not to be caused failure by anything in the heavens or on the earth. Indeed, He is ever Knowing and Competent.

source: ولو يؤاخذ الله الناس بما كسبوا ما ترك على ظهرها من دابة ولكن يؤخرهم إلى أجل مسمى فإذا جاء أجلهم فإن الله كان بعباده بصيرا
en: And if Allah were to impose blame on the people for what they have earned, He would not leave upon the earth any creature. But He defers them for a specified term. And when their time comes, then indeed Allah has ever been, of His servants, Seeing.

source: يس
en: Ya, Seen.

source: والقرآن الحكيم
en: By the wise Qur'an.

source: إنك لمن المرسلين
en: Indeed you, [O Muhammad], are from among the messengers,

source: على صراط مستقيم
en: On a straight path.

source: تنزيل العزيز الرحيم
en: [This is] a revelation of the Exalted in Might, the Merciful,

source: لتنذر قوما ما أنذر آباؤهم فهم غافلون
en: That you may warn a people whose forefathers were not warned, so they are unaware.

source: لقد حق القول على أكثرهم فهم لا يؤمنون
en: Already the word has come into effect upon most of them, so they do not believe.

source: إنا جعلنا في أعناقهم أغلالا فهي إلى الأذقان فهم مقمحون
en: Indeed, We have put shackles on their necks, and they are to their chins, so they are with heads [kept] aloft.

source: وجعلنا من بين أيديهم سدا ومن خلفهم سدا فأغشيناهم فهم لا يبصرون
en: And We have put before them a barrier and behind them a barrier and covered them, so they do not see.

source: وسواء عليهم أأنذرتهم أم لم تنذرهم لا يؤمنون
en: And it is all the same for them whether you warn them or do not warn them - they will not believe.

source: إنما تنذر من اتبع الذكر وخشي الرحمن بالغيب فبشره بمغفرة وأجر كريم
en: You can only warn one who follows the message and fears the Most Merciful unseen. So give him good tidings of forgiveness and noble reward.

source: إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم وكل شيء أحصيناه في إمام مبين
en: Indeed, it is We who bring the dead to life and record what they have put forth and what they left behind, and all things We have enumerated in a clear register.

source: واضرب لهم مثلا أصحاب القرية إذ جاءها المرسلون
en: And present to them an example: the people of the city, when the messengers came to it -

source: إذ أرسلنا إليهم اثنين فكذبوهما فعززنا بثالث فقالوا إنا إليكم مرسلون
en: When We sent to them two but they denied them, so We strengthened them with a third, and they said, "Indeed, we are messengers to you."

source: قالوا ما أنتم إلا بشر مثلنا وما أنزل الرحمن من شيء إن أنتم إلا تكذبون
en: They said, "You are not but human beings like us, and the Most Merciful has not revealed a thing. You are only telling lies."

source: قالوا ربنا يعلم إنا إليكم لمرسلون
en: They said, "Our Lord knows that we are messengers to you,

source: وما علينا إلا البلاغ المبين
en: And we are not responsible except for clear notification."

source: قالوا إنا تطيرنا بكم لئن لم تنتهوا لنرجمنكم وليمسنكم منا عذاب أليم
en: They said, "Indeed, we consider you a bad omen. If you do not desist, we will surely stone you, and there will surely touch you, from us, a painful punishment."

source: قالوا طائركم معكم أئن ذكرتم بل أنتم قوم مسرفون
en: They said, "Your omen is with yourselves. Is it because you were reminded? Rather, you are a transgressing people."

source: وجاء من أقصى المدينة رجل يسعى قال يا قوم اتبعوا المرسلين
en: And there came from the farthest end of the city a man, running. He said, "O my people, follow the messengers.

source: اتبعوا من لا يسألكم أجرا وهم مهتدون
en: Follow those who do not ask of you [any] payment, and they are [rightly] guided.

source: وما لي لا أعبد الذي فطرني وإليه ترجعون
en: And why should I not worship He who created me and to whom you will be returned?

source: أأتخذ من دونه آلهة إن يردن الرحمن بضر لا تغن عني شفاعتهم شيئا ولا ينقذون
en: Should I take other than Him [false] deities [while], if the Most Merciful intends for me some adversity, their intercession will not avail me at all, nor can they save me?

source: إني إذا لفي ضلال مبين
en: Indeed, I would then be in manifest error.

source: إني آمنت بربكم فاسمعون
en: Indeed, I have believed in your Lord, so listen to me."

source: قيل ادخل الجنة قال يا ليت قومي يعلمون
en: It was said, "Enter Paradise." He said, "I wish my people could know

source: بما غفر لي ربي وجعلني من المكرمين
en: Of how my Lord has forgiven me and placed me among the honored."

source: وما أنزلنا على قومه من بعده من جند من السماء وما كنا منزلين
en: And We did not send down upon his people after him any soldiers from the heaven, nor would We have done so.

source: إن كانت إلا صيحة واحدة فإذا هم خامدون
en: It was not but one shout, and immediately they were extinguished.

source: يا حسرة على العباد ما يأتيهم من رسول إلا كانوا به يستهزئون
en: How regretful for the servants. There did not come to them any messenger except that they used to ridicule him.

source: ألم يروا كم أهلكنا قبلهم من القرون أنهم إليهم لا يرجعون
en: Have they not considered how many generations We destroyed before them - that they to them will not return?

source: وإن كل لما جميع لدينا محضرون
en: And indeed, all of them will yet be brought present before Us.

source: وآية لهم الأرض الميتة أحييناها وأخرجنا منها حبا فمنه يأكلون
en: And a sign for them is the dead earth. We have brought it to life and brought forth from it grain, and from it they eat.

source: وجعلنا فيها جنات من نخيل وأعناب وفجرنا فيها من العيون
en: And We placed therein gardens of palm trees and grapevines and caused to burst forth therefrom some springs -

source: ليأكلوا من ثمره وما عملته أيديهم أفلا يشكرون
en: That they may eat of His fruit. And their hands have not produced it, so will they not be grateful?

source: سبحان الذي خلق الأزواج كلها مما تنبت الأرض ومن أنفسهم ومما لا يعلمون
en: Exalted is He who created all pairs - from what the earth grows and from themselves and from that which they do not know.
